export default class Constants {
    static SECTORS = Array.from({ length: 37 }, (_, i) => ({
        number: i,
        color: i === 0 ? "green" : i % 2 === 0 ? "black" : "red",
    }));

    static VALID_BET_TYPES = new Set([
        "красный",
        "черный",
        "зеленый",
        "четное",
        "нечетное",
        "дюжина1",
        "дюжина2",
        "дюжина3",
        "кр",
        "чр",
        "зл",
        "чет",
        "нчет",
        "д1",
        "д2",
        "д3",
    ]);

    static BET_TYPE_MAP = {
        кр: "красный",
        чр: "черный",
        зл: "зеленый",
        чет: "четное",
        нчет: "нечетное",
        д1: "дюжина1",
        д2: "дюжина2",
        д3: "дюжина3",
        черный: "черный",
        зелёный: "зеленый",
        четное: "четное",
        нечётное: "нечетное",
    };

    static AMOUNT_SUFFIXES = {
        к: 1e3,
        тыс: 1e3,
        м: 1e6,
        млн: 1e6,
        б: 1e9,
        миллиард: 1e9,
        т: 1e12,
        трлн: 1e12,
        кв: 1e15,
        квадр: 1e15,
    };
}